##### [실습] titanic 승객 데이터 활용

In [2]:
import numpy as np
import pandas as pd

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [3]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인
df = pd.read_csv('./data/titanic.csv')
df.info()
df.describe()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 기초문제

In [4]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
survive = df['Survived'].value_counts()
print(survive)

0    549
1    342
Name: Survived, dtype: int64

In [5]:
# 2. 승객 나이의 평균 출력
mean =df['Age'].mean()
print(mean)

29.69911764705882

In [6]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
max_fare = df.loc[df['Pclass'] == 1, 'Fare'].max()
df[(df['Pclass']== 1) & (df['Fare'] == max_fare)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

In [7]:
# 4. 여성 승객의 수를 구하여 출력
f_count = df[df['Sex'] == 'female']
print(len(f_count))

314

In [8]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
name_fare = df[df['Fare'] >= 50][['Name', 'Fare']]
print(name_fare)

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [9]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
teenage = df[df['Age'] < 18]
teen_per = teenage['Survived'].mean()
print(teen_per)

0.5398230088495575

In [10]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
fare_2 = df[df['Pclass'] == 2]
fare2_avg = fare_2['Fare'].mean()
print(fare2_avg)

20.66218315217391

In [11]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
max_age = df['Age'].max()
max_man = df.loc[df['Age'] == max_age, ['Age', 'Name']]
print(max_man)

      Age                                  Name
630  80.0  Barkworth, Mr. Algernon Henry Wilson

In [12]:
# 9. S 항구에서 탑승한 승객의 수를 출력
s_cnt = (df['Embarked']== 'S').sum()
print(s_cnt)

644

In [13]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
p3_men = df[(df['Pclass'] ==3) & (df['Sex'] != 'Female')].shape[0]
print(p3_men)

491

- 고급문제

In [24]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [28]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력
# product_sale = df.groupby('Product')['Quantity'].sum().sort_values(ascending=False)[:5]
# product_sale
df.fillna(0)
avg_age = (df.groupby(['Survived', 'Pclass'])['Age'].mean())
avg_age

Survived  Pclass
0         1         43.695312
          2         33.544444
          3         26.555556
1         1         35.368197
          2         25.901566
          3         20.646118
Name: Age, dtype: float64

In [61]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력
s_pass = df[(df['SibSp'] >=3)]
top = s_pass.sort_values(by='Fare', ascending=False)[:5]

res = top[['Name','Age']]
print(res)

                                  Name   Age
88          Fortune, Miss. Mabel Helen  23.0
341     Fortune, Miss. Alice Elizabeth  24.0
27      Fortune, Mr. Charles Alexander  19.0
863  Sage, Miss. Dorothy Edith "Dolly"   NaN
324           Sage, Mr. George John Jr   NaN

In [35]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력
missing = df[df['Age'].isna()]
embarked = missing['Embarked'].value_counts(normalize=True)*100
embarked

S    50.847458
Q    27.683616
C    21.468927
Name: Embarked, dtype: float64

In [37]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력
teen = df[(df['Age'] < 16) & (df['SibSp'] == 0) & (df['Parch'] == 0)]
res = teen[['Name', 'Sex', 'Survived']]
res

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [42]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력
mean_fare = df.loc[df['Pclass'] == 1, 'Fare'].mean()
pc = df[(df['Pclass'] == 1) & (df['Fare'] > mean_fare)]
up_avg = pc[['Name', 'Age', 'Fare']]
up_avg

                                                  Name   Age      Fare
27                      Fortune, Mr. Charles Alexander  19.0  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)   NaN  146.5208
88                          Fortune, Miss. Mabel Helen  23.0  263.0000
118                           Baxter, Mr. Quigg Edmond  24.0  247.5208
195                               Lurette, Miss. Elise  58.0  146.5208
..                                                 ...   ...       ...
779  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  43.0  211.3375
802                Carter, Master. William Thornton II  11.0  120.0000
820  Hays, Mrs. Charles Melville (Clara Jennings Gr...  52.0   93.5000
849       Goldenberg, Mrs. Samuel L (Edwiga Grabowska)   NaN   89.1042
856         Wick, Mrs. George Dennick (Mary Hitchcock)  45.0  164.8667

[66 rows x 3 columns]

In [ ]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력
# mean(), median()
clean = df.dropna(subset=['Age', 'Pclass', 'Fare'])

pas_men = (clean.groupby('Pclass')['Fare'].agg('mean', 'median'))
print(pas_men)

Pclass
1    87.961582
2    21.471556
3    13.229435
Name: Fare, dtype: float64

In [72]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력
port = df.groupby('Embarked')
avg_age = port['Age'].mean()
most_port_sort = df['Embarked'].value_counts().idxmax()

survive_rate = (df[df['Embarked'] == most_port_sort]['Survived'].mean())
print(avg_age)
print(survive_rate)

Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64
0.33695652173913043

In [48]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력
suv_female = df[(df['Sex'] == 'female') & (df['Age'] >= 30) & (df['Survived'] == 1)]

count = len(suv_female)
tot = len(df)
per = count / tot
print(per)

0.10325476992143659

In [51]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력
passenger = df[(df['SibSp'] >=3) & (df['Parch'] >=3)]

count = len(passenger)
tot = len(df)
per = count / tot
print(per)

0.0

In [52]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [56]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력
not_missing = df[(df['Cabin'].notna())]
sur_class = (not_missing.groupby('Pclass')['Survived'].mean())
print(sur_class)

Pclass
1    0.664773
2    0.812500
3    0.500000
Name: Survived, dtype: float64